# Loading Data from CSV File

* the Pandas library in Python provides Excellent, Built-in Support for Time Series Data.
* Pandas Represents Time Series Datasets as a Series.
* A Series is a One-Dimensional Array with a Time Label for Each Row.
* a Dataframe is a Collection of Series.

In [1]:
import pandas as pd

In [3]:
# Import the Csv file From Resources 
dataframe = pd.read_csv('E:/Time Series Analysis and Forecasting Using Python/1. Time Series - Basics/Data + Code/daily-total-female-births-CA.csv', header = 0)

In [4]:
#First 5 Records
dataframe.head()

         date  births
0  1959-01-01      35
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44

In [8]:
# Data Type
dataframe.date.dtype
#Python is Considering the Date Column as Characters

dtype('O')

## Loading data with parse_dates

In [9]:
df2 = pd.read_csv('E:/Time Series Analysis and Forecasting Using Python/1. Time Series - Basics/Data + Code/daily-total-female-births-CA.csv', header = 0, parse_dates = [0])

In [10]:
#First 5 Data
df2.head()

        date  births
0 1959-01-01      35
1 1959-01-02      32
2 1959-01-03      30
3 1959-01-04      31
4 1959-01-05      44

In [11]:
df2.date.dtype
#M8 stands for Date time Format

dtype('<M8[ns]')

### Note:

* dateparse = lambda x: pd.datetime.striptime(x, '%Y-%m-%d%H:%M:%S')
* df = pd.read_csv(.........., parse_date = [0], date_parser = dateparse)

### Loading Data as a Series

In [12]:
series = pd.read_csv('E:/Time Series Analysis and Forecasting Using Python/1. Time Series - Basics/Data + Code/daily-total-female-births-CA.csv', header = 0, parse_dates = [0], index_col = 0, squeeze = True)
# To Convert Dataframe into Series we have given squeeze = True.

In [13]:
#First 5 Records.
series.head()

date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
Name: births, dtype: int64

## Exploring Time Series Data

##### Size

In [14]:
df2.shape #To get the Dimensions

(365, 2)

In [15]:
series.shape

(365,)

### Quering by Time

In [16]:
print(series['1959-01']) #Returns the data For Month 1 and year 1959

date
1959-01-01    35
1959-01-02    32
1959-01-03    30
1959-01-04    31
1959-01-05    44
1959-01-06    29
1959-01-07    45
1959-01-08    43
1959-01-09    38
1959-01-10    27
1959-01-11    38
1959-01-12    33
1959-01-13    55
1959-01-14    47
1959-01-15    45
1959-01-16    37
1959-01-17    50
1959-01-18    43
1959-01-19    41
1959-01-20    52
1959-01-21    34
1959-01-22    53
1959-01-23    39
1959-01-24    32
1959-01-25    37
1959-01-26    43
1959-01-27    39
1959-01-28    35
1959-01-29    44
1959-01-30    38
1959-01-31    24
Name: births, dtype: int64

In [17]:
df2[(df2.date > '1959-01-01') & (df2.date < '1959-01-21')]

         date  births
1  1959-01-02      32
2  1959-01-03      30
3  1959-01-04      31
4  1959-01-05      44
5  1959-01-06      29
6  1959-01-07      45
7  1959-01-08      43
8  1959-01-09      38
9  1959-01-10      27
10 1959-01-11      38
11 1959-01-12      33
12 1959-01-13      55
13 1959-01-14      47
14 1959-01-15      45
15 1959-01-16      37
16 1959-01-17      50
17 1959-01-18      43
18 1959-01-19      41
19 1959-01-20      52

### Descriptive Statistics

* To get Basic Knwowledge of data
* Works Only for Columns having Numeric values

In [18]:
series.describe()

count    365.000000
mean      41.980822
std        7.348257
min       23.000000
25%       37.000000
50%       42.000000
75%       46.000000
max       73.000000
Name: births, dtype: float64

In [19]:
df2.describe()

           births
count  365.000000
mean    41.980822
std      7.348257
min     23.000000
25%     37.000000
50%     42.000000
75%     46.000000
max     73.000000